files/requestWS/branch/envio/req_branch_CamposIndCoop_3_ClassTrib06_001.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:bran="http://branch.webservices.taxbr.ta.thomsonreuters.com/">
	     <soap:Header>  
      </soap:Header>	
	<soap:Body>
		<bran:receiveBranches>
			<!--Optional: -->
			<COMPANY_LIST>
				<!--1 or more repetitions: -->
				<COMPANY>
					<COD_COMPANY>999</COD_COMPANY>
					<!--Optional: -->
					<BRANCH_LIST>
						<!--1 or more repetitions: -->
						<BRANCH>
							<!--Optional: -->
							<IND_DELETE>N</IND_DELETE>
							<COD_BRANCH>Estab 113</COD_BRANCH>
							<DAT_INSERT_UPDATE>2013-01-01</DAT_INSERT_UPDATE>
							<NUM_FED_TAX>86060623000175</NUM_FED_TAX>
							<DSC_BRANCH>Estabelecimento da Empresa 12</DSC_BRANCH>
							<IND_HEAD_OFFICE>N</IND_HEAD_OFFICE>
							<!--Optional: -->
							<DSC_TRADE_NAME>Nome fantasia do estabelecimento 113
							</DSC_TRADE_NAME>
							<COD_ECONO_ACTV>0133410</COD_ECONO_ACTV>
							<!--Optional: -->
							<COD_PATIO_TYPE>AV</COD_PATIO_TYPE>
							<DSC_ADDRESS>Rua do efd social</DSC_ADDRESS>
							<!--Optional: -->
							<NUM_ADDRESS>1879</NUM_ADDRESS>
							<!--Optional: -->
							<DSC_ADDRESS_COMPL>Fundos de outra empresa</DSC_ADDRESS_COMPL>
							<DSC_NEIGHBOURHOOD>Vila do Social</DSC_NEIGHBOURHOOD>
							<COD_ZIP>04500401</COD_ZIP>
							<!--Optional: -->
							<NUM_POST_OFFICE_BOX>014512</NUM_POST_OFFICE_BOX>
							<NUM_DDD>11</NUM_DDD>
							<NUM_PHONE>21590098</NUM_PHONE>
							<!--Optional: -->
							<NUM_FAX>21590500</NUM_FAX>
							<!--Optional: -->
							<DSC_EMAIL>estabelecimento12@empresa12.com.br</DSC_EMAIL>
							<COD_STATE>SP</COD_STATE>
							<COD_CITY>3550308</COD_CITY>
							<!--Optional: -->
							<COD_STATE_TAX>123456909</COD_STATE_TAX>
							<!--Optional: -->
							<COD_MUNICIPAL_TAX>9886088</COD_MUNICIPAL_TAX>
							<!--Optional: -->
							<PROPERTY_LIST>
								<!--1 or more repetitions: -->
								<!--Classificacao Tributaria -->
								<PROPERTY>
									<COD_PROPERTY>CLASSIF_TRIB</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>06</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--Natureza Juridica -->
								<PROPERTY>
									<COD_PROPERTY>NAT_JURIDICA</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>2160</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--Aliquota RAT (Riscos Ambientais do Trabalho) -->
								<PROPERTY>
									<COD_PROPERTY>ALIQ_RAT</COD_PROPERTY>                                                
									<REFERENCE_LIST>
										<REFERENCE>
											<FIELD_REF>CODIGO</FIELD_REF>
											<VALUE_REF>3</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--FAP (Fator Acidentario de Prevencao) -->
								<PROPERTY>
									<COD_PROPERTY>FAP</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>1</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Numero do Processo RAT -->
								<PROPERTY>
									<COD_PROPERTY>NUM_PROCESSO_RAT</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>Proc RAT 1234</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Tipo do Processo RAT -->
								<PROPERTY>
									<COD_PROPERTY>TIPO_PROCESSO_RAT</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>1</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--Numero do Processo FAP -->
								<PROPERTY>
									<COD_PROPERTY>NUM_PROCESSO_FAP</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>Proc FAP 4321</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Tipo do Processo FAP -->
								<PROPERTY>
									<COD_PROPERTY>TIPO_PROCESSO_FAP</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>1</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--Sigla do Ministerio -->
								<PROPERTY>
									<COD_PROPERTY>SIGLA_MIN</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>MDS</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<!--Numero do Certificado -->
								<PROPERTY>
									<COD_PROPERTY>NUM_CERTIFICADO</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>Numero Certificado 009</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Data de Emissao -->
								<PROPERTY>
									<COD_PROPERTY>DAT_EMISSAO</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>2013-03-31</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Data de Vencimento -->
								<PROPERTY>
									<COD_PROPERTY>DAT_VENCTO</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>2013-04-30</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Numero do Protocolo de Renovacao -->
								<PROPERTY>
									<COD_PROPERTY>NUM_PROT_RENOV</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>Numero Protocolo 103</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Data do Protocolo de Renovacao -->
								<PROPERTY>
									<COD_PROPERTY>DAT_PROT_RENOV</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>2013-05-31</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Data de Publicacao no DOU -->
								<PROPERTY>
									<COD_PROPERTY>DAT_DOU</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>2013-06-30</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Numero da Pagina no DOU -->
								<PROPERTY>
									<COD_PROPERTY>NUM_PAG_DOU</COD_PROPERTY>
									<!--Optional: -->
									<VALUE>12345</VALUE>
									<!--Optional: -->
								</PROPERTY>
								<!--Codigo Indicador do Estabelecimento -->
								<PROPERTY>
									<COD_PROPERTY>IND_COOPERATIVA</COD_PROPERTY>
									<!--Optional: -->
									<REFERENCE_LIST>
										<!--Zero or more repetitions: -->
										<REFERENCE>
											<!--Optional: -->
											<FIELD_REF>CODIGO</FIELD_REF>
											<!--Optional: -->
											<VALUE_REF>3</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>
								<PROPERTY>
									<COD_PROPERTY>IND_DES_FOLHA</COD_PROPERTY>                                                
									<REFERENCE_LIST>
										<REFERENCE>
											<FIELD_REF>CODIGO</FIELD_REF>
											<VALUE_REF>0</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>      
								<PROPERTY>
									<COD_PROPERTY>IND_OPT_REG_ELETR</COD_PROPERTY>                                                
									<REFERENCE_LIST>
										<REFERENCE>
											<FIELD_REF>CODIGO</FIELD_REF>
											<VALUE_REF>1</VALUE_REF>
										</REFERENCE>
									</REFERENCE_LIST>
								</PROPERTY>								
							</PROPERTY_LIST>
						</BRANCH>
					</BRANCH_LIST>
				</COMPANY>
			</COMPANY_LIST>
		</bran:receiveBranches>
	</soap:Body>
</soap:Envelope>